Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ2051CA90176.svd
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>RBQSZ[%s]</name>
               <description>Receive Priority Queue Buffer Size</description>
               <addressOffset>0x14A0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>RXBUFSZ</name>
                     <description>DMA Receive Buffer Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCRT1[%s]</name>
               <description>Screening Type 1 Register 0</description>
               <addressOffset>0x1500</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QNMBR</name>
                     <description>Queue Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DSTCM</name>
                     <description>DS/TC Match</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>UDPP</name>
                     <description>UDP Port Match</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DSTCE</name>
                     <description>DS/TC Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPE</name>
                     <description>UDP Port Match Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCRT2[%s]</name>
               <description>Screening Type 2 Register</description>
               <addressOffset>0x1540</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QNMBR</name>
                     <description>Queue Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VLANPRI</name>
                     <description>VLAN Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANE</name>
                     <description>VLAN Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETID</name>
                     <description>EtherType Index</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ETE</name>
                     <description>EtherType Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPAID</name>
                     <description>Compare A Index</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CMPAE</name>
                     <description>Compare A Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPBID</name>
                     <description>Compare B Index</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CMPBE</name>
                     <description>Compare B Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPCID</name>
                     <description>Compare C Index</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CMPCE</name>
                     <description>Compare C Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>IERQ[%s]</name>
               <description>Interrupt Enable Queue 1</description>
               <addressOffset>0x1600</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>IDRQ[%s]</name>
               <description>Interrupt Disable Queue 1</description>
               <addressOffset>0x1620</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>IMRQ[%s]</name>
               <description>Interrupt Mask Register Queue 1</description>
               <addressOffset>0x1640</addressOffset>
               <size>32</size>
               <resetValue>0x00000876</resetValue>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCRT2ET[%s]</name>
               <description>Screening Type 2 EtherType Register 0</description>
               <addressOffset>0x16E0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMPVAL</name>
                     <description>Ethertype compare value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>24</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>SCRT2CMP[%s]</name>
               <description/>
               <addressOffset>0x1700</addressOffset>
               <register>
                  <name>SCRT2CMP0</name>
                  <description>Screening Type 2 Compare Registers Word 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>MASK</name>
                        <description>2Byte Mask/Compare Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>CMPVAL</name>
                        <description>2Byte Compare Value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SCRT2CMP1</name>
                  <description>Screening Type 2 Compare Registers Word 1</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
               </register>
            </cluster>
